class config():
	# default official: the official to display when openning the page
	DEFAULT_OFFICIAL = "习近平"

	# use geocode of 中南海 to encode `中央`
	CENTRAL_LAT = 39.9113
	CENTRAL_LON = 116.3805

	# arbitary chosen geocode for missing location
	UNKNOWN_LAT = 0
	UNKNOWN_LON = 0

	# dictionary for rank
	RANK_MAP = {
		"正国级": 10,
		"副国级": 9,
		"正大军区级": 10,
		"副大军区级": 9,
		"正部级、正军级": 8,
		"副部级、副军级": 7,
		"正厅级、正师级": 6,
		"副厅级、副师级": 5,
		"正处级、正团级": 4,
		"副处级、副团级": 3,
		"正科级、正营级": 2,
		"副科级、副营级": 1,
		"": 0,
		"其他": 0
	}

	# dictionary for degree
	DEGREE_MAP = {
		"专科": -1,
		"本科": -2,
		"硕士": -3,
		"博士": -4,
		"培训": -5,
		"NA": 0
	}

	AXIS_TICKS = [
		"培训",			# -5
		"博士",			# -4
		"硕士",			# -3
		"本科",			# -2
		"专科",			# -1
		"-",			#  0
		"副科/营级",		#  1
		"正科/营级",		#  2
		"副处/团级",		#  3
		"正处/团级",		#  4
		"副厅/师级",		#  5
		"正厅/师级",		#  6
		"副部/军级",		#  7
		"正部/军级",		#  8
		"副国/大军区级",	#  9
		"正国/大军区级"	# 10
	]

	MIN_AGE = 15
	MAX_AGE = 80
	MIN_TICK = -5
	MAX_TICK = 10

	DATETIME_FORMAT = "%Y-%m-%dT%H:%M:%S"

	NATIONAL_CONGRESS = {
		12: "1982-09-01T00:00:00",
		13: "1987-10-25T00:00:00",
		14: "1992-10-12T00:00:00",
		15: "1997-09-12T00:00:00",
		16: "2002-11-08T00:00:00",
		17: "2007-10-15T00:00:00",
		18: "2012-11-08T00:00:00",
		19: "2017-10-18T00:00:00"
	}

	MAJOR_COLOR = {
	    "哲学": 	'#a6cee3',
	    "经济学":'#1f78b4',
	    "法学": 	'#b2df8a',
	    "教育学":'#33a02c',
	    "文学": 	'#fb9a99',
	    "历史学":'#e31a1c',
	    "理学": 	'#fdbf6f',
	    "工学": 	'#ff7f00',
	    "农学": 	'#cab2d6',
	    "医学": 	'#6a3d9a',
	    "军事学":'#ffff99',
	    "管理学":'#b15928',
	    "艺术学":'#c1c766',
	    "其他": 	'#cccccc'	
	}

	RANK_COLOR = {
		"-": '#ffffcc',
		"副科/营级": '#ffeda0',
		"正科/营级": '#fed976',
		"副处/团级": '#feb24c',
		"正处/团级": '#fd8d3c',
		"副厅/师级": '#fc4e2a',
		"正厅/师级": '#e31a1c',
		"副部/军级": '#bd0026',
		"正部/军级": '#800026',
		"副国/大军区级": '#520115',
		"正国/大军区级": '#2b000b'
	}

	TYPE_COLOR = {
		"一线领导职务": "#1f77b4",
		"二线领导职务": "#aec7e8",
		"党口办公厅": "#ff7f0e",
		"政府办公厅": "#ffbb78",
		"军队口": "#2ca02c",
		"知识分子口": "#98df8a",
		"财政经济口": "#d62728",
		"政治法律口": "#ff9896",
		"群团组织口": "#9467bd",
		"宣传文教口": "#c5b0d5",
		"外事统战口": "#8c564b",
		"组织人事口": "#c49c94",
		"纪委监察": "#e377c2",
		"国安": "#f7b6d2",
		"其他": "#7f7f7f"
	}


